namespace HuaheBase
{
    internal static class BaseDef
    {
        public static string[] ChangSheng = new string[] { "长生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养" };

        public static string[] WuXings = new string[] { "金", "水", "木", "火", "土" };

        public static string[] Gans = new string[] { "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" };

        public static string[] Zhis = new string[] { "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥" };

        public static string[] Refs = new string[] { "生", "克", "冲", "合", "三合", "六合", "刑", "害", "长生", "藏", "临", "值" };

        public static string[] NaiYins = new string[] {  "海中金", "炉中火", "大林木", "路旁土", "剑峰金",
                                                         "山头火", "涧下水", "城墙土", "白蜡金", "杨柳木",
                                                         "泉中水", "屋上土", "霹雳火", "松柏木", "长流水",
                                                         "沙中金", "山下火", "平地木", "壁上土", "金箔金",
                                                         "佛灯火", "天河水", "大驿土", "钗钏金", "桑松木",
                                                         "大溪水", "沙中土", "天上火", "石榴木", "大海水" };

        public static string[] NL_DayNames = new string[] {  "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十",
                                                             "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十",
                                                             "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十"};

        public static string[] NL_MonthNames = new string[] { "正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二" };

        public static string[] Gua_Names = new string[] {"地",  "复",   "师",   "临",    "谦",   "明夷", "升",   "泰",
                                                         "豫",  "雷",   "解",   "归妹",  "小过", "丰",   "恒",   "大壮",
                                                         "比",  "屯",   "水",   "节",    "蹇",   "既济", "井",   "需",
                                                         "萃",  "随",   "困",   "泽",    "咸",   "革",   "大过", "夬",
                                                         "剥",  "颐",   "蒙",   "损",    "山",   "贲",   "蛊",   "大畜",
                                                         "晋",  "噬嗑", "未济", "睽",    "旅",   "火",   "鼎",   "大有",
                                                         "观",  "益",   "涣",   "中孚",  "渐",   "家人", "风",   "小畜",
                                                         "否",  "无妄", "讼",   "履",    "遁",   "同人", "姤",   "天" };

        public static string[] Gua_Chi = new string[] { "乾为天：强健、启始", "天风姤：疏漏、相遇", "天山遁：逃遁、隐退", "山地剥：剥落、显露", "火地晋：晋升、前进", "火天大有：收获、丰富", "风地观：考察、观望", "坎为水：坎凹、陷入", "巽为风：跟风、上行下效", "水泽节：节度、制约", "水雷屯：屯积、初始", "水火既济：顺其自然、顺畅", "泽火革：改变、革新", "雷火丰：丰富、张扬", "地水师：单一、率众", "艮为山：堆积、受阻", "山火贲：粉饰、礼仪", "地火明夷：前有险、动则伤", "山泽损：损失、受损", "火泽睽：反目、背驰", "雷山小过：过火，可补救过失", "天泽履：履行、持礼", "风山渐：渐近、缓近", "风泽中孚：坚持、诚信", "震为雷：突发、走动", "雷水解：解决、释放", "火风鼎：独当一面、极致", "地风升：进展、提升", "水风井：规划、局束", "雷泽归妹：如愿、回报", "泽雷随：跟随、归顺", "天地否：受阻、闭塞", "泽风大过：太过分、已遭损失", "风雷益：有益、受益", "山雷颐：颐表、培养", "风天小畜：浅积累，欠充分", "山风蛊：发动、谋事", "离为火：外露、绚丽", "山水蒙：启蒙、不清晰", "火山旅：旅行、客居", "风水涣：涣散、发散", "风火家人：亲人、归家、回收", "天水讼：谈判、诉讼", "坤为地：包含、承载", "天雷无妄：无妄为、无过失", "地雷复：反复、重复", "雷风恒：恒久、不变", "火雷噬嗑：沟通，有目的交流", "地泽临：临近、降临", "地天泰：通泰、通畅", "泽天夬：缺陷、不完整", "水天需：等待、筹备", "水地比：亲密、平等", "火水未济：阻碍、未达目的", "兑为泽：谈话、愉悦", "泽水困：受困、被围", "天火同人：随大流、与众同等", "泽地萃：突出、聚集 ", "泽山咸：参与、遍布", "雷天大壮：众所周知、正当其用", "水山蹇：行险、难关", "雷地豫：欢愉、犹豫", "地山谦：谦逊、深藏不露", "山天大畜：积畜已久、准备充分" };

        public enum BaseTypes { WuXing = 0, Gan, Zhi, GanZhi };
    }

    public abstract class IBase
    {
        public string Name { get; protected set; }

        public int Index { get; protected set; }

        public abstract WuXing 五行 { get; }
    }
}
